# BA 648 Project

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib as mpl
mpl.rcParams['figure.dpi'] = 400 #high res figures
import graphviz #to visualize decision trees

## Loading and Combining two Datasets

### Loading "Beachside" Dataset

In [2]:
Beachside = pd.read_csv('Beachside_Loans.csv')

C:\Users\hoain\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:
Beachside_df = pd.DataFrame(Beachside)

In [4]:
Beachside_df.head()

,MBR_NO,LOAN_NO,LOAN_AMT,int_rate,GRADE,CUST_TITLE,CUST_EMP,annual_inc,LOAN_DT,STAT,...,next_pymnt_d,last_credit_pull_d,mths_since_last_major_derog,tot_coll_amt,TOTAL_COST,total_rev_hi_lim,acc_open_past_24mths,avg_cur_bal,bc_util,chargeoff_within_12_mths
0,828865,68355089,24700.0,11.99,C,Engineer,10+ years,65000.0,Dec-15,Fully Paid,...,NaN,Mar-19,NaN,0.0,204396.0,111800.0,4.0,9733.0,27.1,0.0
1,96781,68426831,11950.0,13.44,C,Veterinary Tecnician,4 years,34000.0,Dec-15,Fully Paid,...,NaN,May-17,NaN,0.0,12798.0,12900.0,0.0,2560.0,91.0,0.0
2,118711,67275481,20000.0,8.49,B,road driver,10+ years,85000.0,Dec-15,Fully Paid,...,NaN,Mar-19,3.0,0.0,141601.0,14500.0,4.0,17700.0,5.7,0.0
3,548993,68616873,8000.0,11.48,B,Vendor liaison,10+ years,42000.0,Dec-15,Fully Paid,...,NaN,Nov-18,75.0,0.0,199696.0,18000.0,5.0,28528.0,41.4,0.0
4,666541,68356421,22400.0,12.88,C,Executive Director,6 years,95000.0,Dec-15,Current,...,Apr-19,Mar-19,54.0,0.0,376218.0,39800.0,9.0,23514.0,39.9,0.0

In [5]:
Beachside_df.shape

(393215, 30)

In [6]:
Beachside_df.columns

Index(['MBR_NO', 'LOAN_NO', 'LOAN_AMT', 'int_rate', 'GRADE', 'CUST_TITLE',
       'CUST_EMP', 'annual_inc', 'LOAN_DT', 'STAT', 'title', 'CUST_ZIP',
       'CUST_ST', 'dti', 'MBR_DT', 'FICO', 'mths_since_last_delinq',
       'total_pymnt', 'last_pymnt_d', 'last_pymnt_amnt', 'next_pymnt_d',
       'last_credit_pull_d', 'mths_since_last_major_derog', 'tot_coll_amt',
       'TOTAL_COST', 'total_rev_hi_lim', 'acc_open_past_24mths', 'avg_cur_bal',
       'bc_util', 'chargeoff_within_12_mths'],
      dtype='object')

Removing unnecessary varialbes as the project requests. "Member Number, Member Date, Loan Number, Loan Date, Loan Stat, Title, Time Employed, State, Zip, Loan Amount, Down, CredRisk, Source, Credit Score, Grade, Response" are variables remained.

In [7]:
col_names = ['Mem_Num','Mem_Date','Loan_Num','Loan_Date','Loan_Stat', 'Loan_Amt', 
             'Title' , 'Time_Employed', 'State', 'Zip','Cred_Score' , 'Grade']

In [8]:
Beachside_df_val_select = pd.DataFrame(data= Beachside_df.loc[:,['MBR_NO','MBR_DT','LOAN_NO','LOAN_DT','STAT','LOAN_AMT','CUST_TITLE','CUST_EMP',
                              'CUST_ST','CUST_ZIP','FICO','GRADE']])

In [9]:
Beachside_df_1 =Beachside_df_val_select.set_axis(col_names, axis=1)

In [10]:
Beachside_df_1.shape

(393215, 12)

In [11]:
Beachside_df_1.head()

,Mem_Num,Mem_Date,Loan_Num,Loan_Date,Loan_Stat,Loan_Amt,Title,Time_Employed,State,Zip,Cred_Score,Grade
0,828865,Dec-99,68355089,Dec-15,Fully Paid,24700.0,Engineer,10+ years,SD,577xx,719.0,C
1,96781,Oct-87,68426831,Dec-15,Fully Paid,11950.0,Veterinary Tecnician,4 years,GA,300xx,694.0,C
2,118711,Feb-99,67275481,Dec-15,Fully Paid,20000.0,road driver,10+ years,SC,293xx,709.0,B
3,548993,Nov-94,68616873,Dec-15,Fully Paid,8000.0,Vendor liaison,10+ years,RI,029xx,704.0,B
4,666541,Apr-95,68356421,Dec-15,Current,22400.0,Executive Director,6 years,SC,290xx,714.0,C

In [12]:
Beachside_df_1['Response'] = None

In [13]:
Beachside_df_1.head()

,Mem_Num,Mem_Date,Loan_Num,Loan_Date,Loan_Stat,Loan_Amt,Title,Time_Employed,State,Zip,Cred_Score,Grade,Response
0,828865,Dec-99,68355089,Dec-15,Fully Paid,24700.0,Engineer,10+ years,SD,577xx,719.0,C,None
1,96781,Oct-87,68426831,Dec-15,Fully Paid,11950.0,Veterinary Tecnician,4 years,GA,300xx,694.0,C,None
2,118711,Feb-99,67275481,Dec-15,Fully Paid,20000.0,road driver,10+ years,SC,293xx,709.0,B,None
3,548993,Nov-94,68616873,Dec-15,Fully Paid,8000.0,Vendor liaison,10+ years,RI,029xx,704.0,B,None
4,666541,Apr-95,68356421,Dec-15,Current,22400.0,Executive Director,6 years,SC,290xx,714.0,C,None

### Loading "WilsonandSons" Dataset

In [14]:
Wilson_df = pd.read_csv('WilsonandSons.csv')

C:\Users\hoain\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3441: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [15]:
Wilson_df.shape

(295000, 22)

In [16]:
Wilson_df.head()

,Member Number,Loan Number,Net Loan Amount,Grade,Sub Grade,Customer Job,Length of Employment,Home Ownership,Income,Loan Date,...,Customer Zip,Customer State,Member Date,High FICO,Delinquent,Total Payments,Last Date Paid,Last Payment,Last Credit Check,Average Balance
0,1592618,68407277,3600.0,C,C4,leadman,10+ years,MORTGAGE,55000.0,Dec-15,...,190xx,PA,Aug-03,679.0,30.0,4421.723917,Jan-19,122.67,Mar-19,20701.0
1,1945270,68341763,20000.0,B,B4,truck driver,10+ years,MORTGAGE,63000.0,Dec-15,...,605xx,IL,Aug-00,699.0,NaN,22705.924290,Jun-17,15813.30,Mar-19,31617.0
2,672413,66310712,35000.0,C,C5,Information Systems Officer,10+ years,MORTGAGE,110000.0,Dec-15,...,076xx,NJ,Sep-08,789.0,NaN,31464.010000,Feb-19,829.90,Mar-19,23192.0
3,1263724,68356421,22400.0,C,C2,Executive Director,6 years,MORTGAGE,95000.0,Dec-15,...,290xx,SC,Apr-95,714.0,54.0,19275.330000,Feb-19,508.30,Mar-19,23514.0
4,661182,68566886,29900.0,C,C2,Corporate Insurance,10+ years,MORTGAGE,65000.0,Dec-15,...,219xx,MD,May-04,719.0,NaN,34033.214180,Mar-17,25234.24,Jan-18,15732.0

In [17]:
Wilson_df.columns

Index(['Member Number', 'Loan Number', 'Net Loan Amount', 'Grade', 'Sub Grade',
       'Customer Job', 'Length of Employment', 'Home Ownership', 'Income',
       'Loan Date', 'Loan Status', 'Type', 'Customer Zip', 'Customer State',
       'Member Date', 'High FICO', 'Delinquent', 'Total Payments',
       'Last Date Paid', 'Last Payment', 'Last Credit Check',
       'Average Balance'],
      dtype='object')

In [18]:
Wilson_df['Loan Number'].nunique()

295000

In [19]:
Wilson_df_val_select = pd.DataFrame(Wilson_df.loc[:,['Member Number','Member Date','Loan Number','Loan Date',
                                                     'Loan Status','Net Loan Amount','Customer Job',
                                                     'Length of Employment','Customer State','Customer Zip',
                                                     'High FICO','Grade']])

In [20]:
Wilson_df_val_select.head()

,Member Number,Member Date,Loan Number,Loan Date,Loan Status,Net Loan Amount,Customer Job,Length of Employment,Customer State,Customer Zip,High FICO,Grade
0,1592618,Aug-03,68407277,Dec-15,Fully Paid,3600.0,leadman,10+ years,PA,190xx,679.0,C
1,1945270,Aug-00,68341763,Dec-15,Fully Paid,20000.0,truck driver,10+ years,IL,605xx,699.0,B
2,672413,Sep-08,66310712,Dec-15,Current,35000.0,Information Systems Officer,10+ years,NJ,076xx,789.0,C
3,1263724,Apr-95,68356421,Dec-15,Current,22400.0,Executive Director,6 years,SC,290xx,714.0,C
4,661182,May-04,68566886,Dec-15,Fully Paid,29900.0,Corporate Insurance,10+ years,MD,219xx,719.0,C

In [21]:
Wilson_df_1 = Wilson_df_val_select.set_axis(col_names, axis =1)

In [22]:
Wilson_df_1['Response'] = None

In [23]:
Wilson_df_1.head()

,Mem_Num,Mem_Date,Loan_Num,Loan_Date,Loan_Stat,Loan_Amt,Title,Time_Employed,State,Zip,Cred_Score,Grade,Response
0,1592618,Aug-03,68407277,Dec-15,Fully Paid,3600.0,leadman,10+ years,PA,190xx,679.0,C,None
1,1945270,Aug-00,68341763,Dec-15,Fully Paid,20000.0,truck driver,10+ years,IL,605xx,699.0,B,None
2,672413,Sep-08,66310712,Dec-15,Current,35000.0,Information Systems Officer,10+ years,NJ,076xx,789.0,C,None
3,1263724,Apr-95,68356421,Dec-15,Current,22400.0,Executive Director,6 years,SC,290xx,714.0,C,None
4,661182,May-04,68566886,Dec-15,Fully Paid,29900.0,Corporate Insurance,10+ years,MD,219xx,719.0,C,None

### Combining two Datasets

In [24]:
Application_df = pd.concat([Beachside_df_1,Wilson_df_1], ignore_index= True)

In [25]:
Application_df

,Mem_Num,Mem_Date,Loan_Num,Loan_Date,Loan_Stat,Loan_Amt,Title,Time_Employed,State,Zip,Cred_Score,Grade,Response
0,828865,Dec-99,68355089,Dec-15,Fully Paid,24700.0,Engineer,10+ years,SD,577xx,719.0,C,None
1,96781,Oct-87,68426831,Dec-15,Fully Paid,11950.0,Veterinary Tecnician,4 years,GA,300xx,694.0,C,None
2,118711,Feb-99,67275481,Dec-15,Fully Paid,20000.0,road driver,10+ years,SC,293xx,709.0,B,None
3,548993,Nov-94,68616873,Dec-15,Fully Paid,8000.0,Vendor liaison,10+ years,RI,029xx,704.0,B,None
4,666541,Apr-95,68356421,Dec-15,Current,22400.0,Executive Director,6 years,SC,290xx,714.0,C,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...
688210,1359220,Feb-90,70562083,Feb-16,Fully Paid,18000.0,Coordinator,6 years,WI,543xx,689.0,C,None
688211,1764354,Sep-80,70162363,Mar-16,Fully Paid,15000.0,Guidance Secretary,10+ years,NJ,077xx,719.0,E,None
688212,1792356,Nov-03,72663394,Feb-16,Charged Off,14400.0,Purchasing manager,10+ years,PA,168xx,679.0,D,None
688213,1796459,May-90,72663353,Feb-16,Fully Paid,16000.0,Consultant,< 1 year,NC,284xx,714.0,B,None
688214,804494,Mar-89,72785737,Feb-16,Fully Paid,6000.0,Administrative Assistant,6 years,MS,394xx,719.0,A,None

In [26]:
Application_df.shape

(688215, 13)

## Data Exploring and Cleaning

### Verifying Basic Data Integrity

The "Loan_Num" column seems like it contians unique identifers. To verify whether "Loan_Num" in fact cointains unique values through whole the dataset, we can count the values of this columns.

In [27]:
Application_df['Loan_Num'].nunique()

599382

There are some duplicated applications in the dataset.

In [28]:
Loan_Num_counts = Application_df['Loan_Num'].value_counts()

In [29]:
Loan_Num_counts.head()

74081952     2
130946224    2
73763215     2
55898451     2
55958862     2
Name: Loan_Num, dtype: int64

In [30]:
Loan_Num_counts.value_counts()

1    510549
2     88833
Name: Loan_Num, dtype: int64

In [31]:
dup_mask = Loan_Num_counts == 2

In [32]:
dup_mask[0:5]

74081952     True
130946224    True
73763215     True
55898451     True
55958862     True
Name: Loan_Num, dtype: bool

In [33]:
dup_Loan_Num = Loan_Num_counts.index[dup_mask]
dup_Loan_Num = list(dup_Loan_Num)

In [34]:
dup_Loan_Num[0:5]

['74081952', 130946224, '73763215', 55898451, 55958862]

In [35]:
len(dup_Loan_Num)

88833

In [36]:
Application_df.loc[Application_df['Loan_Num'].isin(dup_Loan_Num[0:3]),:].head(20)

,Mem_Num,Mem_Date,Loan_Num,Loan_Date,Loan_Stat,Loan_Amt,Title,Time_Employed,State,Zip,Cred_Score,Grade,Response
158188,137505,Dec-04,130946224,Mar-18,Current,2500.0,Journey Admin Clerk,4 years,CA,957xx,719.0,A,None
377708,722098,Sep-02,74081952,Mar-16,Fully Paid,15000.0,Data entry manager,10+ years,PA,180xx,699.0,B,None
386783,251113,Nov-00,73763215,Mar-16,Current,20000.0,Clerical,9 years,CA,925xx,674.0,F,None
511661,343604,Dec-04,130946224,Mar-18,Current,2500.0,Journey Admin Clerk,4 years,CA,957xx,719.0,A,None
676601,564370,Sep-02,74081952,Mar-16,Fully Paid,15000.0,Data entry manager,10+ years,PA,180xx,699.0,B,None
683413,692354,Nov-00,73763215,Mar-16,Current,20000.0,Clerical,9 years,CA,925xx,674.0,F,None

In [37]:
len(Application_df.loc[Application_df['Loan_Num'].isin(dup_Loan_Num),[ 'Loan_Num', 'Loan_Date', 'Loan_Stat', 'Loan_Amt',
                                                                  'Title', 'Time_Employed', 'State', 'Zip', 'Cred_Score', 
                                                                  'Grade',  'Response']].duplicated())

177666

Except "Member Number" and "Member Date" values, duplicated applications contain exactly same values. Thus, we can delete duplacated applications.

In [38]:
Application_Drop_dup = Application_df.drop_duplicates(subset=['Loan_Num'])

In [39]:
Application_Drop_dup.shape

(599382, 13)

In [40]:
Application_Drop_dup['Loan_Num'].nunique()

599382

### Exploring and Cleaning Data

In [41]:
Application_Clean_df1 = Application_Drop_dup

In [42]:
Application_Clean_df1.columns

Index(['Mem_Num', 'Mem_Date', 'Loan_Num', 'Loan_Date', 'Loan_Stat', 'Loan_Amt',
       'Title', 'Time_Employed', 'State', 'Zip', 'Cred_Score', 'Grade',
       'Response'],
      dtype='object')

In [43]:
Application_Clean_df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 599382 entries, 0 to 688214
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Mem_Num        599382 non-null  int64
 1   Mem_Date       599377 non-null  object
 2   Loan_Num       599382 non-null  object
 3   Loan_Date      599377 non-null  object
 4   Loan_Stat      599377 non-null  object
 5   Loan_Amt       599377 non-null  float64
 6   Title          556877 non-null  object
 7   Time_Employed  559106 non-null  object
 8   State          599377 non-null  object
 9   Zip            599377 non-null  object
 10  Cred_Score     599377 non-null  float64
 11  Grade          599377 non-null  object
 12  Response       0 non-null       object
dtypes: float64(2), int64(1), object(10)
memory usage: 64.0+ MB

Removing variables that will not be used in the model

In [44]:
Application_Clean_df2 = Application_Clean_df1[['Loan_Num', 'Loan_Stat', 'Loan_Amt','Time_Employed',
                                               'State', 'Cred_Score', 'Grade', 'Response']]

In [45]:
Application_Clean_df2.head()

,Loan_Num,Loan_Stat,Loan_Amt,Time_Employed,State,Cred_Score,Grade,Response
0,68355089,Fully Paid,24700.0,10+ years,SD,719.0,C,None
1,68426831,Fully Paid,11950.0,4 years,GA,694.0,C,None
2,67275481,Fully Paid,20000.0,10+ years,SC,709.0,B,None
3,68616873,Fully Paid,8000.0,10+ years,RI,704.0,B,None
4,68356421,Current,22400.0,6 years,SC,714.0,C,None

In [46]:
Application_Clean_df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 599382 entries, 0 to 688214
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Loan_Num       599382 non-null  object
 1   Loan_Stat      599377 non-null  object
 2   Loan_Amt       599377 non-null  float64
 3   Time_Employed  559106 non-null  object
 4   State          599377 non-null  object
 5   Cred_Score     599377 non-null  float64
 6   Grade          599377 non-null  object
 7   Response       0 non-null       object
dtypes: float64(2), object(6)
memory usage: 41.2+ MB

In [47]:
Application_Clean_df3 = Application_Clean_df2.dropna(axis = 0, subset=['Time_Employed'])

In [48]:
Application_Clean_df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 559106 entries, 0 to 688214
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Loan_Num       559106 non-null  object
 1   Loan_Stat      559106 non-null  object
 2   Loan_Amt       559106 non-null  float64
 3   Time_Employed  559106 non-null  object
 4   State          559106 non-null  object
 5   Cred_Score     559106 non-null  float64
 6   Grade          559106 non-null  object
 7   Response       0 non-null       object
dtypes: float64(2), object(6)
memory usage: 38.4+ MB

In [49]:
Application_Clean_df3['State'].value_counts()

CA    75668
TX    46889
NY    45676
FL    39347
IL    22981
NJ    20512
PA    19174
OH    18896
GA    18374
VA    15726
NC    15386
MI    14407
MD    13578
AZ    13035
MA    13019
CO    12147
WA    11391
MN    10302
IN     9783
TN     9243
CT     9040
MO     8887
NV     7929
WI     7465
SC     6725
AL     6643
LA     6528
OR     6333
KY     5323
OK     5164
KS     4684
AR     4018
UT     3607
MS     3479
NM     2905
NH     2893
HI     2434
RI     2431
NE     2329
WV     2015
DE     1577
MT     1488
AK     1361
ME     1338
DC     1312
VT     1250
WY     1174
SD     1110
ID     1102
ND     1028
Name: State, dtype: int64

In [50]:
Regions ={'CA':'West','CO':'West','WY':'West','MT':'West','ID':'West',
          'WA':'West','OR':'West','UT':'West','NV':'West','AK':'West','HI':'West',
         'ME':'Northeast','MA':'Northeast','RI':'Northeast','CT':'Northeast','NH':'Northeast','VT':'Northeast',
         'NY':'Northeast','PA':'Northeast','NJ':'Northeast','DE':'Northeast','MD':'Northeast','DC':'Northeast',
         'WV':'Southeast','VA':'Southeast','KY':'Southeast','TN':'Southeast','NC':'Southeast','SC':'Southeast',
         'GA':'Southeast','AL':'Southeast','MS':'Southeast','AR':'Southeast','LA':'Southeast','FL':'Southeast',
         'OH':'Midwest','IN':'Midwest','MI':'Midwest','IL':'Midwest','MO':'Midwest','WI':'Midwest','MN':'Midwest',
         'IA':'Midwest','KS':'Midwest','NE':'Midwest','SD':'Midwest','ND':'Midwest',
         'TX':'Southwest','OK':'Southwest','NM':'Southwest','AZ':'Southwest'}

In [51]:
Application_Clean_df3['Region'] = Application_Clean_df2['State'].map(Regions)

C:\Users\hoain\AppData\Local\Temp/ipykernel_51288/1878994453.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Application_Clean_df3['Region'] = Application_Clean_df2['State'].map(Regions)

In [52]:
Application_Clean_df3['Loan_Stat'].value_counts()

Fully Paid            255514
Current               227476
Charged Off            66908
Late (31-120 days)      5756
In Grace Period         2348
Late (16-30 days)       1091
Default                   13
Name: Loan_Stat, dtype: int64

In [53]:
Application_Clean_df3['Region'].value_counts()

Southeast    132807
Northeast    131800
West         124634
Midwest      101872
Southwest     67993
Name: Region, dtype: int64

In [54]:
Application_Clean_df3['Time_Employed'].value_counts()

10+ years    199581
2 years       53945
< 1 year      50980
3 years       48287
1 year        39483
4 years       36212
5 years       36187
6 years       25056
8 years       24397
7 years       23490
9 years       21488
Name: Time_Employed, dtype: int64

In [55]:
Time_Groups = {'< 1 year':'under 2 years','1 year':'under 2 years','2 years':'under 2 years',
              '3 years':'3-5 years','4 years':'3-5 years','5 years':'3-5 years',
              '6 years':'6-10 years','7 years':'6-10 years','8 years':'6-10 years','9 years':'6-10 years',
              '10+ years':'above 10 years'}

In [56]:
Application_Clean_df3['Time_work'] = Application_Clean_df3['Time_Employed'].map(Time_Groups)

C:\Users\hoain\AppData\Local\Temp/ipykernel_51288/2829900419.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Application_Clean_df3['Time_work'] = Application_Clean_df3['Time_Employed'].map(Time_Groups)

In [57]:
Application_Clean_df3['Grade'].value_counts()

C    162399
B    159935
A    113689
D     75802
E     33963
F     10009
G      3309
Name: Grade, dtype: int64

There are 7 status of Loan applications: Charged Off,Current,Default,Fully Paid,In Grace Period,Late (16-30 days),Late (31-120 days). Beside that there are 7 credit grade levels: A, B, C, D, E, F, G. We will consider several criterias to adjust an application is booked or rejected.
Loan Grade of applications are below C, the applications wuold be rejected. Loan with status of "Charge off" and "Default" would be rejected as well. And the the rest applications would be accepted.

In [58]:
Grade_below_C = ['D','E','F','G']
Status_Rejected = ['Charged Off','Default']

In [59]:
Application_Clean_df3.loc[(Application_Clean_df3['Grade'].isin(Grade_below_C))|
                         (Application_Clean_df3['Loan_Stat'].isin(Status_Rejected)),
                          ['Response']] = 'Rejected'

C:\Users\hoain\anaconda3\lib\site-packages\pandas\core\indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [60]:
Application_Clean_df3.loc[Application_Clean_df3['Response'].isnull(),['Response']] = 'Accepted'

In [61]:
Application_Clean_df3['Response'].value_counts()

Accepted    398199
Rejected    160907
Name: Response, dtype: int64

In [62]:
Application_Clean_df3.head()

,Loan_Num,Loan_Stat,Loan_Amt,Time_Employed,State,Cred_Score,Grade,Response,Region,Time_work
0,68355089,Fully Paid,24700.0,10+ years,SD,719.0,C,Accepted,Midwest,above 10 years
1,68426831,Fully Paid,11950.0,4 years,GA,694.0,C,Accepted,Southeast,3-5 years
2,67275481,Fully Paid,20000.0,10+ years,SC,709.0,B,Accepted,Southeast,above 10 years
3,68616873,Fully Paid,8000.0,10+ years,RI,704.0,B,Accepted,Northeast,above 10 years
4,68356421,Current,22400.0,6 years,SC,714.0,C,Accepted,Southeast,6-10 years

In [63]:
from pandas_profiling import ProfileReport
profile = ProfileReport(Application_Clean_df3, explorative=True,)

In [64]:
profile.to_file('application.html')

Summarize dataset:   0%|          | 0/24 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [47]:
Application_Clean_df3.to_csv('Cleaned_Application_Data.csv', index=)